examples/flows/compiled/while_nested/flow.dot
digraph "while_nested_flow" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    end_while_nested_flow [label="end_while_nested_flow", fillcolor=palegreen];
    handler_finalize [label="handler_finalize", fillcolor=lightblue];
    handler_init [label="handler_init", fillcolor=lightblue];
    handler_inner [label="handler_inner", fillcolor=lightblue];
    handler_outer [label="handler_outer", fillcolor=lightblue];
    handler_outer_end [label="handler_outer_end", fillcolor=lightblue];
    router_while_nested_flow_line_13_seq_6 [label="router_while_nested_flow_line_13_seq_6", fillcolor=wheat];
    router_while_nested_flow_line_14_while_1 [label="router_while_nested_flow_line_14_while_1", fillcolor=wheat];
    router_while_nested_flow_line_15_seq_5 [label="router_while_nested_flow_line_15_seq_5", fillcolor=wheat];
    router_while_nested_flow_line_17_seq_4 [label="router_while_nested_flow_line_17_seq_4", fillcolor=wheat];
    router_while_nested_flow_line_18_while_2 [label="router_while_nested_flow_line_18_while_2", fillcolor=wheat];
    router_while_nested_flow_line_19_seq_3 [label="router_while_nested_flow_line_19_seq_3", fillcolor=wheat];
    start_while_nested_flow [label="start_while_nested_flow", fillcolor=palegreen];

    start_while_nested_flow -> handler_init;
    handler_init -> router_while_nested_flow_line_13_seq_6;
    router_while_nested_flow_line_19_seq_3 -> handler_inner;
    router_while_nested_flow_line_18_while_2 -> router_while_nested_flow_line_19_seq_3 [label="p['j'] < p['max_j']"];
    router_while_nested_flow_line_19_seq_3 -> router_while_nested_flow_line_18_while_2;
    router_while_nested_flow_line_18_while_2 -> handler_outer_end [label="not (p['j'] < p['max_j'])"];
    router_while_nested_flow_line_17_seq_4 -> router_while_nested_flow_line_18_while_2;
    router_while_nested_flow_line_15_seq_5 -> handler_outer;
    handler_outer -> router_while_nested_flow_line_17_seq_4;
    router_while_nested_flow_line_14_while_1 -> router_while_nested_flow_line_15_seq_5 [label="p['i'] < p['max_i']"];
    router_while_nested_flow_line_15_seq_5 -> router_while_nested_flow_line_14_while_1;
    router_while_nested_flow_line_14_while_1 -> handler_finalize [label="not (p['i'] < p['max_i'])"];
    router_while_nested_flow_line_13_seq_6 -> router_while_nested_flow_line_14_while_1;
    handler_finalize -> end_while_nested_flow;
    handler_inner -> end_while_nested_flow;
    handler_outer_end -> end_while_nested_flow;
}
